Repository: BelkaDev/thunar
Catalog: po-doc/*.po
Languages: fr

source: Thunar File Manager
fr: Gestionnaire de fichiers Thunar

source: System development
fr: Développement système

source: Software developer
fr: Développeur logiciel

source: This manual describes version @PACKAGE_VERSION@ of @PACKAGE_NAME@.
fr: Ce manuel décrit la version @PACKAGE_VERSION@ de @PACKAGE_NAME@.

source: Introduction to @PACKAGE_NAME@
fr: Introduction à @PACKAGE_NAME@

source: Thunar is a new modern file manager for the Xfce Desktop Environment. Thunar has been designed from the ground up to be fast and easy-to-use. Its user interface is clean and intuitive, and does not include any confusing or useless options by default. Thunar is fast and responsive with a good start up time and folder load time.
fr: Thunar est un nouveau gestionnaire de fichiers moderne pour l'environnement de bureau Xfce. Thunar a été conçu dès le départ pour être rapide et simple d'utilisation. Son interface, claire et intuitive, ne contient pas d'éléments superflus ou pouvant prêter à confusion. Thunar a un temps de chargement des dossiers très court et son propre temps de chargement l'est tout autant.

source: The Thunar file manager thereby provides an integrated access point to your files and applications. You can use the file manager to do the following:
fr: Le gestionnaire de fichiers Thunar fournit un point d'accès centralisé pour vos fichiers et applications. Voici quelques exemples d'utilisation du gestionnaire de fichiers :

source: Create folders and documents.
fr: Créer des dossiers et documents.

source: Display your files and folders.
fr: Afficher vos fichiers et dossiers.

source: Manage your files and folders.
fr: Gérer vos fichiers et dossiers.

source: Run and manage custom actions.
fr: Exécuter et gérer des actions personnalisées.

source: Access Removable Media.
fr: Accéder à vos périphériques amovibles.

source: The File Manager Window
fr: La fenêtre du gestionnaire de fichiers

source: By default the file manager window consists of a shortcut pane on the left side, the main area on the right and a pathbar above the main area.
fr: Par défaut le gestionnaire de fichiers contient un panneau de raccourcis sur la gauche et une fenêtre principale sur la droite avec une barre de chemin au dessus.

source: File Manager Window
fr: Fenêtre du gestionnaire de fichiers

source: The <guilabel>Shortcut Pane</guilabel> provides shortcuts to different folders on your system. The first shortcut will lead to your <emphasis>Home Folder</emphasis>, the folder you store all your personal data, and will therefore have the name of the current user. The second shortcut will take you to the trash bin, which stores deleted files that can be recovered later. The third shortcut takes you to the <emphasis>Desktop Folder</emphasis>, which contains the files and folders that are displayed on the desktop. The fourth shortcut will take you to the root of your file system - you may want to explore it a bit, even though it may be confusing to you if you are new to Linux/Unix. Just click on the different folders and see what is inside.
fr: Le <guilabel>Panneau de raccourcis</guilabel> fournit des raccourcis vers différent dossiers de votre système. Le premier raccourci mène au <emphasis>Dossier personnel</emphasis>, il contient toutes vos données personnelles et prend de ce fait le nom de votre utilisateur actuel. Le second raccourci mène à la corbeille contenant les éléments effacés pouvant être récupérés si nécessaire. Le troisième raccourci est un lien vers le <emphasis>Bureau</emphasis> contenant tous les éléments visibles dessus et le quatrième raccourci vous mène à la base de votre système de fichiers - n'hésitez pas à l'explorer un peu, même s'il vous paraît confus si vous êtes nouveau dans le monde Linux/Unix. Cliquez sur les différents dossiers et regardez ce qui s'y trouve.

source: Below the <emphasis>File System</emphasis> shortcut, the removable drives and media will be displayed. In the screenshot above, you can see a <guilabel>Floppy Drive</guilabel> shortcut. Click on these shortcuts to access the data stored on the removable drives and media. See <xref linkend="using-removable-media"/> for further details.
fr: Sous le raccourci <emphasis>Système de fichiers</emphasis>, viendront s'afficher les disques amovibles et autres médias. Sur la capture d'écran ci-dessus, on peut voir le raccourci d'un <guilabel>Lecteur de disquettes</guilabel>. Cliquez sur ces raccourcis pour accéder aux disques amovibles et autres médias. Lire <xref linkend="using-removable-media"/> pour plus de détails.

source: The remaining shortcuts are user defined. Add your own shortcuts by simply dragging folders to the <guilabel>Shortcuts Pane</guilabel>. This will allow you to access important folders instantly. To remove a previously added shortcut, right-click on the shortcut and choose <guimenuitem>Remove Shortcut</guimenuitem>. To rename a previously added shortcut, right-click on the shortcut and choose <guimenuitem>Rename Shortcut</guimenuitem>. Note that these actions affect only the shortcut, not the folder referenced by the shortcuts.
fr: Le reste des raccourcis peuvent être créés par vous-même. Il suffit pour cela de faire glisser un dossier dans le <guilabel>Panneau des raccourcis</guilabel>. Ces raccourcis permettent d'accéder à des dossiers important en un clin d'oeil. Pour supprimer ou renommer un raccourci créé par vous-même, cliquez avec le bouton droit de la souris et choisissez respectivement <guimenuitem>Supprimer le raccourci</guimenuitem> ou <guimenuitem>Renommer le raccourci</guimenuitem>. Notez bien que seul le nom du raccourci change et pas celui du dossier en question.

source: The <emphasis>main area</emphasis> will always display the contents of the current folder. Double click on folders to enter them, and right-click on files or folders to get a context-menu offering some choices of what to do with it. Select multiple files by dragging a rectangle over them with the mouse. Alternatively, select one file, hold down the <keycap>Shift</keycap> key, and increase or decrease the selection using the arrow keys.
fr: La <emphasis>partie principale</emphasis> affiche toujours le contenu du dossier actuel. Double-cliquez sur les dossiers pour entrer dedans et cliquez-droit sur les fichiers ou dossiers pour afficher un menu contextuel avec plusieurs actions possibles. Sélectionnez plusieurs fichiers à la fois en maintenant le bouton de la souris enfoncé et en dessinant un rectangle par dessus. Vous pouvez aussi sélectionner un fichier, maintenir la touche <keycap>shift</keycap> enfoncée et agrandir ou diminuer le champ de sélection avec les touches directionnelles.

source: The <emphasis>pathbar</emphasis> will always show the path you took to get to the folder you are currently at. You can click on any pathbar button to change to the folder it represents. Right-click on a pathbar button to bring up a context-menu with some options.
fr: La <emphasis>Barre de chemin</emphasis> affiche toujours le chemin jusqu'au dossier actuel. Vous pouvez cliquer sur l'un des boutons de la barre de chemin pour accéder au dossier qu'il représente. Un clic-droit sur un bouton affiche un menu contextuel avec des options.

source: Customizing the Appearance
fr: Configurer l'apparence

source: There are many ways to customize the appearance of the file manager windows. In case you do not like the way the icons are displayed, choose <menuchoice><guimenu>View</guimenu><guimenuitem>View as Detailed List</guimenuitem></menuchoice> from the main menu to have the contents of the current folder displayed as a list.
fr: Il existe plusieurs moyen de configurer l'apparence de la fenêtre du gestionnaire de fichiers. Si vous n'aimez pas la manière dont sont affichés les icônes, choisissez <menuchoice><guimenu>Vue</guimenu><guimenuitem>Vue en liste détaillée</guimenuitem></menuchoice> dans le menu principal pour afficher le contenu du dossier actuel sous forme de liste détaillée.

source: You can have the file manager windows display a location bar instead of the pathbar by choosing <menuchoice><guimenu>View</guimenu><guimenuitem>Location Selector</guimenuitem><guimenuitem>Toolbar Style</guimenuitem></menuchoice> from the main menu.
fr: Le gestionnaire de fichiers peut afficher une barre d'outils avec chemin d'accès au lieu de la barre de chemin, avec ses boutons correspondants aux dossiers, en choisissant <menuchoice><guimenu>Vue</guimenu><guimenuitem>Sélecteur de chemin</guimenuitem><guimenuitem>Barre d'outils</guimenuitem></menuchoice> dans le menu principal.

source: In case you prefer a treeview in the left pane, choose <menuchoice><guimenu>View</guimenu><guimenuitem>Side Pane</guimenuitem><guimenuitem>Tree</guimenuitem></menuchoice> from the main menu.
fr: Au cas où vous préféreriez une vue en arborescence dans le panneau latéral, choisissez <menuchoice><guimenu>Vue</guimenu><guimenuitem>Panneau latéral</guimenuitem><guimenuitem>Arborescence</guimenuitem></menuchoice> dans le menu principal.

source: Visible Columns in the Detailed List View
fr: Colonnes visibles de la vue en liste détaillée

source: If you prefer to display the contents of the folder as a list, using the <guilabel>Detailed List View</guilabel>, you can customize the columns displayed in the list view. To customize the visible columns, choose <menuchoice><guimenu>View</guimenu><guimenuitem>Configure Columns...</guimenuitem></menuchoice> from the main menu.
fr: Si vous préférez afficher le contenu des dossiers en liste détaillée, sélectionnez <menuchoice><guimenu>Vue</guimenu><guimenuitem>Vue en liste détaillée</guimenuitem></menuchoice>. Les colonnes de cette vue peuvent être configurée dans le menu <menuchoice><guimenu>Vue</guimenu><guimenuitem>Configurer les colonnes...</guimenuitem></menuchoice> du menu principal.

source: Visible Columns
fr: Colonnes visibles

source: Select the columns you want to be displayed from the list of available columns. Click <guibutton>Move Up</guibutton> or <guibutton>Move Down</guibutton> to change the order of the columns. Click <guibutton>Use Default</guibutton> to revert your changes.
fr: Dans la liste des colonnes disponibles, sélectionnez celles que vous voulez afficher. La disposition des colonnes peut être changée avec les boutons <guibutton>Monter</guibutton> et <guibutton>Descendre</guibutton>. Appuyez sur le bouton <guibutton>Valeurs par défaut</guibutton> pour remettre la disposition par défaut.

source: Column Sizing
fr: Dimensionnement de colonne

source: Select the option <guibutton>Automatically expand columns as needed</guibutton> if you want the list view columns to expand automatically if the needed to ensure the text is fully visible.
fr: Cochez la case <guibutton>Élargir automatiquement la taille des colonnes</guibutton> si vous voulez que les colonnes s'ajustent au nom des fichiers.

source: Working with Files and Folders
fr: Gérer vos fichiers et dossiers

source: Opening Files
fr: Ouvrir des fichiers

source: When you open a file, the file manager performs the default action for that file type. For example, opening a text file will display it in the default text editor, while opening an image file will display the image in the default image viewer.
fr: Lorsque vous ouvrez un fichier, le gestionnaire de fichiers exécute l'application par défaut liée à ce type de fichier. Par exemple, l'ouverture d'un fichier texte se fera dans l'éditeur de texte alors que l'ouverture d'une image se fera dans un visionneur d'images.

source: The file manager checks the extension of a file to determine the type of a file. If the file has no known extension, the file manager examines the contents of the file.
fr: Le gestionnaire de fichiers vérifie l'extension du fichier pour déterminer à quel type de fichier il a affaire. Au cas où le fichier n'aurait pas d'extension, il examinera le contenu du fichier.

source: Executing the Default Action
fr: Exécuter une action par défaut

source: To execute the default for a file, double-click on the file. For example, the default action for audio files is to play the it with the default music playing application. In this case, you can double-click on the file to open the file in the music player.
fr: Pour exécuter une action par défaut sur un fichier, il suffit de double-cliquer sur le fichier. Par exemple, l'action par défaut pour les fichiers musicaux est de les écouter dans un lecteur de musique. Il suffit donc de double-cliquer dessus pour l'écouter.

source: You can set <application>Thunar</application> preferences so that you click once on a file to execute the default action. For information, see <xref linkend="preferences-behavior"/>.
fr: Vous pouvez configurer <application>Thunar</application> pour ouvrir les fichiers d'un simple clic. Reportez-vous à la section <xref linkend="preferences-behavior"/> pour de plus amples informations.

source: Executing Non-Default Actions
fr: Exécuter des actions spéciales

source: To execute actions other than the default action for a file, select the file that you want to perform an action on. Choose the desired action from the <emphasis>Open With</emphasis> choices available in <guimenu>File</guimenu> menu or an <guimenu>Open With</guimenu> submenu.
fr: Pour exécuter des actions autres que celles par défaut pour un certain fichier, sélectionnez le fichier et choisissez l'option <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Ouvrir avec</guimenuitem></menuchoice> ou <guimenu>Ouvrir avec</guimenu>dans le menu contextuel d'un clique droit sur le fichier.

source: Adding Actions
fr: Ajouter des actions

source: To add actions associated with a file type, perform the following steps:
fr: Pour ajouter des actions à un certain type de fichiers, suivez ces instructions :

source: In the main area, select a file of the type to which you want to add an action.
fr: Dans la partie principale, choisissez un fichier dont vous voulez ajouter une action.

source: Choose <menuchoice><guimenu>File</guimenu><guimenuitem>Open With Other Application...</guimenuitem></menuchoice> from the main menu.
fr: Choisissez <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Ouvrir avec une autre application...</guimenuitem></menuchoice> dans le menu principal.

source: Either choose an application in the <guilabel>Open With</guilabel> dialog or select <guibutton>Use a custom command</guibutton> and browse to the program with which you wish to open this type.
fr: Choisissez une application dans la liste proposée ou cliquez sur <guibutton>Utiliser une commande personnalisée</guibutton> pour chercher l'application avec laquelle vous aimeriez ouvrir ce type de fichiers.

source: The action you have chosen is now added to the list of actions for that particular file type. If you enabled the <guibutton>Use as default for this kind of file</guibutton> option or there was no prior action associated with the type, the newly added action is the default.
fr: L'action choisie est maintenant ajoutée à la liste d'applications pour ce type de fichier. Si vous avez par la même occasion coché la case <guibutton>Utiliser cette action par défaut pour ce type de fichiers</guibutton>, l'action sera utilisée par défaut pour ce type de fichiers.

source: You may also add actions using the <guibutton>Open With</guibutton> button under <menuchoice><guimenu>File</guimenu><guimenuitem>Properties...</guimenuitem></menuchoice>.
fr: Vous pouvez aussi définir une action avec le bouton <guibutton>Ouvrir avec</guibutton> du menu <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Propriétés...</guimenuitem></menuchoice>.

source: Modifying Actions
fr: Modifier des actions

source: To modify the actions associated with a file or file type, perform the following steps:
fr: Pour modifier des actions associées à un certain type de fichier, suivez ces instructions :

source: In the main area, select a file of the type for which you want to modify the action.
fr: Dans la partie principale, choisissez un fichier dont vous voulez modifier l'action.

source: Choose <menuchoice><guimenu>File</guimenu><guimenuitem>Properties...</guimenuitem></menuchoice> from the main menu.
fr: Choisissez <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Propiétés...</guimenuitem></menuchoice> dans le menu principal.

source: Select the new default action using the <guilabel>Open With</guilabel> button or add a new action by choosing <guimenuitem>Open With Other Application...</guimenuitem> from the drop down menu.
fr: Sélectionnez la nouvelle action par défaut avec le bouton <guilabel>Ouvrir avec</guilabel> ou ajoutez une nouvelle action dans le menu déroulant <guimenuitem>Ouvrir avec une autre application...</guimenuitem>.

source: To remove a previously added action for a file type, bring up the <guilabel>Open With</guilabel> dialog as described above, right-click the action you want to remove and choose <guimenuitem>Remove Launcher</guimenuitem>.
fr: Pour supprimer une action définie au préalable, cliquez sur <guilabel>Ouvrir avec</guilabel> comme décrit plus haut, cliquez-droit sur l'action en question et choisissez <guimenuitem>Supprimer le lanceur</guimenuitem>.

source: File Properties
fr: Propriétés des fichiers

source: The file properties window shows more information about any file or folder in the file manager. With this window, you can also do the following:
fr: La fenêtre propriétés affiche plus d'information à propos du fichier sélectionné. Vous pouvez aussi effectuer les actions suivantes :

source: Change the icon for special files, such as application launchers and URL links.
fr: Changer l'icône pour certains fichiers spéciaux comme des lanceurs d'applications et des liens URL.

source: Add or remove emblems for a file or folder.
fr: Ajouter ou supprimer des emblèmes pour un fichier ou dossier.

source: Change the UNIX file permissions for a file or folder.
fr: Changer les droits UNIX sur les fichiers ou dossiers.

source: Choose which application is used to open a file and other files of the same type.
fr: Choisir une application pour ouvrir des fichiers d'un certain type.

source: To open the file properties window, perform the following steps:
fr: Pour ouvrir la fenêtre des propriétés d'un fichier, suivez ces instructions :

source: Select the file or folder whose properties you want to examine or change. You cannot select multiple items at once and display the properties that are in common to all items currently.
fr: Sélectionnez le fichier ou dossier dont vous voulez consulter les propriétés. Dans l'état actuel de Thunar il n'est pas possible de consulter les propriétés communes à plusieurs fichiers sélectionnés en même temps.

source: Right-click the selected item and choose <guimenuitem>Properties...</guimenuitem> from the context menu.
fr: Cliquez-droit sur le fichier sélectionné et choisissez <guimenuitem>Propriétés...</guimenuitem> dans le menu contextuel.

source: Press <keycombo><keycap>Alt</keycap><keycap>Return</keycap></keycombo>.
fr: Appuyez sur <keycombo><keycap>Alt</keycap><keycap>Entrée</keycap></keycombo>.

source: Do one of the following: <placeholder-1/>
fr: Faites une des actions suivantes : <placeholder-1/>

source: Using Removable Media
fr: Utiliser des périphériques amovibles

source: Accessing Removable Media
fr: Accéder aux périphériques amovibles

source: Thunar supports removable media if it was built with support for <ulink type="http" url="http://freedesktop.org/wiki/Software_2fhal">HAL</ulink>, or if you are using <ulink type="http" url="http://www.freebsd.org/">FreeBSD</ulink>. Note however that on FreeBSD 6.0 or newer, it is suggested to use HAL rather than the native support provided by Thunar.
fr: Thunar permet d'accéder aux périphériques amovibles s'il est compilé avec le support pour <ulink type="http" url="http://freedesktop.org/wiki/Software_2fhal">HAL</ulink> ou si vous utilisez le système <ulink type="http" url="http://www.freebsd.org/">FreeBSD</ulink>. Notez bien que si vous utilisez FreeBSD 6.0 ou supérieur, il est conseillé d'utiliser HAL en lieu et place du support interne de Thunar.

source: To Mount Media
fr: Pour monter des médias

source: To <emphasis>mount</emphasis> media is to make the file system of the media available for access. When you mount media, the file system of the media is attached as a subdirectory to your file system.
fr: <emphasis>Monter</emphasis> des médias avec la commande <emphasis>mount</emphasis> signifie rendre accessible le système de fichiers du média. Lorsque vous montez un média, son système de fichiers vient s'ajouter en tant que sous-dossier dans votre système de fichier.

source: To access media, insert the media in the appropriate device, or connect the new device to your computer (i.e. connect an USB stick to one of your USB ports). An object that represents the media is added to the side pane of the file manager. If <application>xfdesktop</application> is running and configured to display <guilabel>File/launcher icons</guilabel> this object will also be added to your desktop.
fr: Pour accéder aux médias, insérez le média dans le périphérique prévu à cet effet ou connectez le périphérique à votre ordinateur (e.g. connecter une clef USB à un des port USB). Un objet représentant le média s'ajoute au panneau de raccourcis. Si <application>xfdesktop</application> est utilisé et configuré pour afficher les <guilabel>Fichier/icônes lanceurs</guilabel>, le périphérique sera aussi ajouté sur le bureau.

source: To actually mount the media, click on the object that represents the media. For example, to mount a floppy diskette, click on the <guilabel>Floppy Drive</guilabel> object in the side pane. The file manager will now add the file system of the media to your file system hierarchy and display the contents of the floppy diskette in the main area.
fr: Pour monter (mount) le média, cliquez sur l'objet le représentant. Par exemple, pour monter un lecteur de disquettes, cliquez sur l'objet représentant le <guilabel>Lecteur de disquettes</guilabel> dans le panneau latéral. Le gestionnaire de fichier s'occupe d'ajouter le système de fichier du lecteur de disquettes au votre et affiche son contenu dans sa partie principale.

source: To Eject Media
fr: Pour éjecter un média

source: If the drive for the media is a motorized drive (i.e. a CD-ROM drive), right-click on the media object in the side pane or on the desktop and choose <guilabel>Eject Volume</guilabel>. The media is ejected from the drive after a few seconds. If the drive for the media is not motorized (i.e. a floppy drive or an USB stick), right-click on the media object and choose <guilabel>Unmount Volume</guilabel>. After a short period of time, a notification will appear to inform you that it is now safe to remove the media or disconnect the drive from the computer.
fr: Si le lecteur de médias est motorisé (e.g. un lecteur de CD-ROM), cliquez-droit sur le média dans le panneau latéral ou sur le bureau et choisissez <guilabel>Éjecter le périphérique</guilabel>. Le disque est éjecté après quelques secondes. Au cas où le lecteur ne serait pas motorisé (e.g. un lecteur de disquettes ou une clef USB), cliquez-droit sur le média en question et choisissez <guilabel>Éjecter le périphérique</guilabel>. Un message de notification s'affiche pour confirmer que le média peut être retiré en toute sécurité.

source: Unmount notification
fr: Notification de démontage
