Repository: BelkaDev/thunar
Catalog: po-doc/*.po
Languages: fr

source: If the shortcut doesn't change, then you need to enable the feature in GTK+. This can be achieved in 3 ways:
fr: Au cas où cela ne fonctionnerait pas, vous devez activer l'option dans GTK+ et vous avez trois moyens pour le faire :

source: If you are running Xfce 4.3 or above then you can enable <guilabel>Editable menu accelerators</guilabel> in the <guilabel>User Interface Preferences</guilabel> dialog.
fr: Si vous utilisez Xfce 4.3 ou supérieur, vous pouvez activer l'option <guilabel>Raccourcis clavier éditables</guilabel> dans les <guilabel>Préférences de l'interface utilisateur</guilabel>.

source: If you are running GNOME then you can enable <guilabel>Editable menu accelerators</guilabel> in the <guilabel>Menu and Toolbars</guilabel> control center dialog.
fr: Si vous utilisez GNOME, vous pouvez activer les <guilabel>Raccourcis clavier éditables</guilabel> dans la section <guilabel>Menu et barre d'outils</guilabel> du centre de contrôle.

source: Otherwise put the following in your <filename>~/.gtkrc-2.0</filename> file (create the file if it doesn't exist):<screen>gtk-can-change-accels=1</screen>
fr: Vous pouvez aussi ajouter les lignes suivantes dans votre fichier <filename>~/.gtkrc-2.0</filename> (créez le fichier s'il n'existe pas) :<screen>gtk-can-change-accels=1</screen>

source: Where does Thunar store the keyboard shortcuts?
fr: Où Thunar stocke-t'il ses raccourcis clavier ?

source: The custom keyboard shortcuts are stored in the standard GTK+ accel map format in a file located at <filename>$XDG_CONFIG_HOME/Thunar/accels.scm</filename>. Lines starting with <literal>;</literal> are comments. See the GTK+ documentation for details about the file format.
fr: Les raccourcis clavier personnalisés sont stockés dans un format de liste standard de GTK+ situé dans <filename>$XDG_CONFIG_HOME/Thunar/accels.scm</filename>. Les lignes commençant par <literal>;</literal> sont des commentaires. Veuillez consulter la documentation de GTK+ à propos de ce format de fichier.

source: If you are a packager or a system administrator and want to provide a system wide default for the keyboard shortcuts, that is different from the default shortcuts in Thunar, you can create a file <filename>Thunar/accels.scm</filename> in one of the <envar>$XDG_CONFIG_DIRS</envar>. For example, if <filename role="directory">/etc/xdg</filename> is part of <envar>$XDG_CONFIG_DIRS</envar> (the default for most Linux distributions), you can install system wide defaults to <filename>/etc/xdg/Thunar/accels.scm</filename>. Thunar will then load shortcuts from this file on first startup.
fr: Si vous êtes un packager ou administrateur système et vous voulez fournir des raccourcis clavier par défaut pour tout le système, différents des raccourcis par défaut de Thunar, vous pouvez créer un fichier <filename>Thunar/accels.scm</filename> dans un des dossier de <envar>$XDG_CONFIG_DIRS</envar>. Par exemple, si <filename role="directory">/etc/xdg</filename> fait partie de <envar>$XDG_CONFIG_DIRS</envar> (par défaut dans la plupart des distributions Linux), vous pouvez installer des paramètres par défaut pour tout le système dans <filename>/etc/xdg/Thunar/accels.scm</filename>. Thunar lira se fichier de configuration à son premier démarrage.

source: Support
fr: Assistance

source: To report a bug or to make a suggestion regarding this application or this manual, use the bug tracking system at <ulink url="http://bugzilla.xfce.org/enter_bug.cgi?product=Thunar&amp;format=guided">http://bugzilla.xfce.org/</ulink>. Remember that useful bug reports are ones that get bugs fixed, so a useful bug report has two qualities:
fr: Pour signaler un bogue ou si vous avez une suggestion à propos de cette application ou manuel, utilisez notre système pour traquer les bogue en suivant ce lien <ulink url="http://bugzilla.xfce.org/enter_bug.cgi?product=Thunar&amp;format=guided">http://bugzilla.xfce.org/</ulink>. Souvenez-vous que les rapports de bogues utiles sont ceux qui aident à les corriger. Un rapport de bogue utile a donc les deux qualités suivantes :

source: <emphasis role="bold">Reproducible.</emphasis> If the developer cannot see the bug himself to prove that it exists, he will most probably not be able to fix it at all. Every detail you can provide helps.
fr: <emphasis role="bold">Reproductible.</emphasis> Si le développeur ne peut pas reproduire le bogue, il ne sera probablement pas en mesure de le corriger. Chaque détail que vous pouvez fournir est utile et peut aider.

source: <emphasis role="bold">Specific.</emphasis> The quicker the developer can isolate the problem to a specific area, the more likely he will expediently fix it.
fr: <emphasis role="bold">Spécifique.</emphasis> Plus le développeur pourra isoler le bogue à une partie spécifique rapidement, plus il sera à même de le fixer dans les plus brefs délais.

source: In case you want to request a new feature, please make clear why you consider it a worth addition for the application. It is more likely that a new feature gets added if you provide good arguments for the feature. It will increase the chance of addition even more if you provide a patch that implements the requested feature, but make sure that you read the file <ulink type="http" url="http://svn.xfce.org/svn/xfce/terminal/trunk/HACKING">HACKING</ulink> - especially the section labeled <emphasis>Coding Style</emphasis> - before you start hacking up the source.
fr: Au cas où vous aimeriez voir une fonctionnalité ajoutée à l'application, expliquez clairement pourquoi vous la considérez comme un plus à l'application. Vous aurez plus de chances de voir cette fonctionnalité ajoutée si vous donnez de bons arguments. Vous aurez encore plus de chance de la voir ajoutée si vous fournissez directement un patch qui implémente cette fonctionnalité mais avant de commencer à modifier le code source, assurez-vous de lire le fichier <ulink type="http" url="http://svn.xfce.org/svn/xfce/terminal/trunk/HACKING">HACKING</ulink> avant de soumettre votre patch, surtout la section intitulée <emphasis>Coding Style</emphasis>.

source: Else, if you have questions about the use or installation of this software, please ask on the <ulink type="http" url="http://foo-projects.org/mailman/listinfo/thunar-dev">thunar-dev mailing list</ulink> or point your IRC client to <emphasis role="bold">irc.freenode.net</emphasis>, join the channel <emphasis role="bold">#thunar</emphasis> and ask for help.
fr: Par ailleurs, si vous avez des questions à propos de l'installation de ce logiciel, posez les sur la liste de distribution <ulink type="http" url="http://foo-projects.org/mailman/listinfo/thunar-dev">thunar-dev</ulink> ou rejoignez le canal IRC <emphasis role="bold">#thunar</emphasis> sur le serveur <emphasis role="bold">irc.freenode.net</emphasis> et demandez de l'aide.

source: About @PACKAGE_NAME@
fr: À propos de @PACKAGE_NAME@

source: @PACKAGE_NAME@ was written by Benedikt Meurer (<email>benny@xfce.org</email>). Visit the <ulink url="http://thunar.xfce.org/" type="http">Thunar website</ulink> for more information.
fr: @PACKAGE_NAME@ a été écrit par Benedikt Meurer (<email>benny@xfce.org</email>). Visitez le site <ulink url="http://thunar.xfce.org/" type="http">Thunar</ulink> pour plus d'informations.

source: This documentation was written by Benedikt Meurer (<email>benny@xfce.org</email>). The latest version of this document is always available from the <ulink type="http" url="http://thunar.xfce.org/">Thunar website</ulink>.
fr: Ce document a été écrit par Benedikt Meurer (<email>benny@xfce.org</email>). La toute dernière version de ce document est toujours disponible sur le site <ulink url="http://thunar.xfce.org/" type="http">Thunar</ulink>

source: translator-credits
fr: Maximilian Schleiss <maximilian@xfce.org>, 2007.
