Repository: BelkaDev/thunar
Catalog: po-doc/*.po
Languages: fr

source: However this notification will only be displayed if support for <application>libnotify</application> is enabled, and you have installed a notification daemon. A notification daemon for Xfce is available from the <ulink type="http" url="http://goodies.xfce.org/projects/applications/notification-daemon-xfce">Xfce Goodies Project</ulink>. If notification support is not available, wait until the context menu disappears before you remove the media or disconnect the drive.
fr: Cette notification n'apparaîtra que si vous avez activé le support pour <application>libnotify</application> et qu'un démon de notification a été installé. Il existe un démon de notification pour Xfce dont voici le lien <ulink type="http" url="http://goodies.xfce.org/projects/applications/notification-daemon-xfce">Xfce Goodies Project</ulink>. Si le support opur la notification n'est pas disponible, patientez jusqu'à la disparition du menu contextuel avant de retirer le média ou de déconnecter le disque.

source: Be aware that you cannot eject or unmount media that is still in use by one or more applications. Therefore if the file manager refuses to eject media, make sure you close all applications that were accessing the media, and be sure to also check command line applications running in <application>Terminal</application> windows.
fr: Notez toutefois qu'il n'est pas possible d'éjecter ou démonter des médias utilisés par une ou plusieurs applications. Si le gestionnaire de fichiers refuse d'éjecter un média, fermez toutes les applications ayant accédé au média et assurez-vous qu'aucune ligne de commande d'un émulateur de <application>Terminal</application> ne pointe dessus.

source: Make sure to unmount removable media before ejecting. Do not eject a diskette from the floppy drive before your unmount the diskette. Do not remove an USB stick before you unmount the flash drive. If you do not unmount the media first you might lose data or cause your system to crash.
fr: Assurez-vous de démonter (unmount) vos périphériques amovibles et médias avant de les éjecter. Ne sortez pas une disquette avant de l'avoir démontée. Ne déconnectez pas une clef USB avant de l'avoir démontée. Si vous ne démontez pas votre média avant de le déconnecter, vous risquez de perdre des données ou rendre votre système instable.

source: Management of Removable Drives and Media
fr: Gestion de disques amovibles et de médias

source: Thunar is also able to automatically manage removable drives and media if the <ulink type="http" url="http://www.foo-projects.org/~benny/projects/thunar-volman/index.html">thunar-volman</ulink> package is installed on your system. Note however that this feature requires HAL support.
fr: Thunar est aussi capable de gérer automatiquement les disques amovibles et les médias pour autant que le paquet <ulink type="http" url="http://www.foo-projects.org/~benny/projects/thunar-volman/index.html">thunar-volman</ulink> soit installé sur votre système. Remarquez que cette fonction requiert le support pour HAL.

source: Now, if HAL support is available and <application>thunar-volman</application> is installed on your system, you can choose to enable the <guilabel>Volume Management</guilabel> feature of Thunar. Therefore, open the file manager preferences, go to the <guilabel>Advanced</guilabel> page and check the <guilabel>Enable Volume Management</guilabel> button.
fr: Du moment que le support HAL est disponible et que <application>thunar-volman</application> est installé sur votre système, vous pouvez choisir d'activer l'option <guilabel>Gestionnaire de volume</guilabel> dans Thunar. Pour cela, ouvrez la fenêtre des préférences de Thunar, cliquez sur l'onglet <guilabel>Avancé</guilabel> et cochez la case <guilabel>Activer le gestionnaire de volume</guilabel>.

source: The next step is to customize the management of removable drives and media to your needs. Click on the <guilabel>Configure</guilabel> link in the <guilabel>Volume Management</guilabel> section, right below the button. The <guilabel>Removable Drives and Media</guilabel> configuration dialog will be displayed.
fr: L'étape suivante consiste à personnaliser la gestion des disques et médias amovibles. Cliquez sur le lien <guilabel>Configurer</guilabel> de la section <guilabel>Gestionnaire de volume</guilabel> juste en dessous de la case à cocher, pour afficher la fenêtre <guilabel>Disques amovibles et médias</guilabel>.

source: Removable Drives and Media
fr: Disques amovibles et médias

source: If you have used the <application>gnome-volume-manager</application> previously, you should feel right at home, because it was designed to look and behave similar to <application>gnome-volume-manager</application>. The preferences are divided by device categories to make it easy to locate the option for you specific device.
fr: Vous ne devriez pas vous sentir dépaysé si vous avez utilisé <application>gnome-volume-manager</application> auparavant, car le <guilabel>Gestionnaire de volume</guilabel> a été conçu pour réagir de même et lui ressembler. Les préférences sont divisées par catégorie de périphérique pour simplifier la recherche d'options pour votre périphérique spécifique.

source: The <guilabel>Storage</guilabel> page contains the most important options. As the name suggests these options apply only to storage devices like external harddisk drives, USB sticks and CD-ROMs. The <guilabel>Removable Storage</guilabel> options are described in detail below.
fr: La page <guilabel>Stockage</guilabel> contient les options les plus importantes. Comme son nom l'indique, ces options ne s'appliquent qu'aux périphériques de stockage comme les disques dur externes, clefs USB et CD-ROMs. Les options de la page <guilabel>Stockage amovible</guilabel> sont décrites plus bas.

source: Mount removable drives when hot-plugged
fr: Monter les disques amovibles à la connexion

source: Enable this option to automatically mount file systems on removable drives (i.e. external harddisk drives or USB sticks) when such drives are plugged into the computer.
fr: Activer cette option pour monter les systèmes de fichiers des disques amovibles (e.g. Disques dur externes ou clefs USB) lorsque ce genre de périphériques sont connectés à l'ordinateur.

source: This option must be enabled for certain other features to work with removable drives. For example, if you disable this option, certain kinds of portable music players cannot be detected any more and so, even if you enabled the <guilabel>Play music files when connected</guilabel> option on the <guilabel>Multimedia</guilabel> page, the specified command will not be run when you hot-plug your portable music player.
fr: Cette option doit être activée pour permettre à d'autres options de fonctionner avec des disques amovibles. Par exemple, en désactivant cette option certains lecteurs de musique portables ne pourraient plus être détectés et l'action d'<guilabel>Écouter la musique à la connexion</guilabel> de la page multimédia ne fonctionnerait pas une fois le périphérique connecté.

source: Mount removable media when inserted
fr: Monter les médias amovibles à l'insertion

source: Enable this option to automatically mount file systems on removable media (i.e. CD-ROMs or DVDs) when you insert the media into the drive.
fr: Activez cette option pout monter (mount) les systèmes de fichiers de médias amovibles (e.g. CD-ROMs ou DVDs) automatiquement à l'insertion.

source: This option must be enabled for certain other features to work with removable media. For example, if you disable this option, it is impossible to detect whether the removable media has auto-run capabilities, and so the <guilabel>Auto-run programs on new drives and media</guilabel> option has no effect for removable media.
fr: Cette option doit être activée pour permettre à d'autres options de fonctionner avec des médias amovibles. Par exemple, en désactivant cette option il n'est plus possible de déterminer si le média a la fonction d'auto-exécution, ce qui annule l'option <guilabel>Auto-exécution d'applications pour les nouveaux disques et médias</guilabel>.

source: Browse removable media when inserted
fr: Parcourir les médias amovibles à l'insertion

source: Enable this option to automatically display the content of newly inserted media in the file manager. Note however, that the contents will only be displayed if no other action was possible or you choose to ignore the other possible actions. For example, if you insert a CD-ROM with auto-run capabilities and the <guilabel>Auto-run programs on new drives and media</guilabel> option is enabled, you will be prompted whether you want to allow or ignore the auto-run. If you choose to ignore the auto-run the contents will be displayed in the file manager.
fr: Activez cette option pour afficher le contenu, à l'insertion de nouveaux médias, dans le gestionnaire de fichiers. Notez bien que le contenu ne sera affiché que si aucune autre action n'est possible ou que vous choisissiez d'ignorer cette action. Par exemple, si vous insérez un CD-ROM avec fonction d'auto-démarrage et l'option d'<guilabel>Auto-exécution d'applications pour les nouveaux disques et médias</guilabel> est activée, il vous sera demandé si vous voulez permettre ou ignorer l'auto-exécution. Si vous décidez d'ignorer l'auto-exécution, le contenu du disque ou média sera affiché dans le gestionnaire de fichiers.

source: Auto-run programs on new drives and media
fr: Auto-exécution d'applications pour les nouveaux disques et médias

source: Enable this option to make use of auto-run capabilities of certain removable drives and media. See the <ulink type="http" url="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html">Desktop Application Autostart Specification</ulink> for details about the auto-run mechanism. To enhance security, you will always be prompted to confirm the auto-run.
fr: Activez cette option pour faire usage de la capacité d'auto-exécution de certains lecteurs amovibles et médias. Suivez ce lien <ulink type="http" url="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html">Desktop Application Autostart Specification</ulink> pour de plus amples détails à propos du mécanisme d'auto-exécution. Pour des raisons de sécurité, il vous sera toujours demandé de confirmer l'auto-exécution.

source: If the Windows emulator <ulink type="http" url="http://www.winehq.org/">WINE</ulink> is installed on your system, the auto-run mechanism will also try to run <filename>autorun.exe</filename> files using WINE.
fr: Si l'émulateur Windows <ulink type="http" url="http://www.winehq.org/">WINE</ulink> est installé sur votre système, le mécanisme d'auto-exécution essaiera aussi d'exécuter les fichier <filename>autorun.exe</filename> en utilisant WINE.

source: Auto-open files on new drives and media
fr: Auto-ouverture de fichiers pour les nouveaux disques et médias

source: Enable this option to make of auto-open capabilities of certain removable drives and media. See the <ulink type="http" url="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html">Desktop Application Autostart Specification</ulink> for details about the auto-open mechanism. To enhance security, you will always be prompted to confirm the auto-open.
fr: Activez cette option pour faire l'usage de la capacité d'auto-ouverture de certains disques amovibles et médias. Suivez ce lien <ulink type="http" url="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html">Desktop Application Autostart Specification</ulink> pour de plus amples détails sur le mécanisme d'auto-ouverture. Pour des raisons de sécurité, il vous sera toujours demandé de confirmer l'auto-ouverture.

source: The remaining options allow you to specify a command to run when a certain kind of media is inserted into a drive or a certain kind of external device is connected. The command can use three special variables, that will be substituted when the command is run:
fr: Le reste des options permet de spécifier une commande à exécuter lors de l'insertion de certains médias dans un lecteur ou à la connexion de certains types de lecteurs amovibles. L'on peut substituer trois variables spéciales à la commande à exécuter :

source: Each appearance of <literal>%d</literal> in the command will be substituted with the device file path of the newly added device. For example, if you have plugged in an USB stick, the device file path will be <filename>/dev/da0s1</filename> or <filename>/dev/sda1</filename>.
fr: Chaque apparition de <literal>%d</literal> dans la commande se substitue avec le chemin d'accès jusqu'au fichier représentant le nouveau périphérique ajouté. Par exemple, si vous connectez une clef USB, le chemin d'accès jusqu'au fichier représentant le périphérique sera <filename>/dev/sda0</filename> ou <filename>/dev/sda1</filename>.

source: If no device file is associated with the device or the device file could not be found for some reason, the variable <literal>%d</literal> will be substituted with the empty string.
fr: Si aucun fichier n'est associé au périphérique ou s'il n'a pas été trouvé pour quelconque raison, la variable <literal>%d</literal> est substituée par un vide.

source: Each appearance of <literal>%h</literal> in the command will be substituted with the HAL UDI of the newly added device.
fr: Chaque apparition de <literal>%h</literal> dans la commande est substitué par l'UDI HAL du périphérique nouvellement ajouté.

source: Each appearance of <literal>%m</literal> in the command will be substituted with the mount point where the newly added device was mounted. If the device cannot be mounted (for example printers or keyboards) or if the automatic mounting was disabled, <literal>%m</literal> will be substituted with the empty string.
fr: Chaque apparition de <literal>%m</literal> dans la commande se substitue par le point de montage où le nouveau périphérique a été monté. Au cas où le périphérique ne peut être monté (e.g. imprimantes ou claviers) ou si le montage automatique est désactivé, la variable <literal>%m</literal> est substituée par un vide.

source: Troubleshooting the Volume Manager
fr: Dépanner le Gestionnaire de volumes

source: Useful tips to trouble shoot the volume manager in case it does not work as expected.
fr: Quelques conseils pour dépanner le gestionnaire de volumes au cas où il ne fonctionnerait pas comme prévu.

source: Make sure <application>Thunar</application> is running as daemon. The volume manager depends on this, as it is not a daemon by itself. By default, Xfce automatically spawns <application>Thunar</application> as daemon on startup. If it got killed for some reason, open the <guilabel>Run program</guilabel> (using the keyboard shortcut <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo> or right-click on the desktop and choose <guilabel>Run Program...</guilabel> from the desktop menu), enter <literal>Thunar --daemon</literal> and click <guibutton>Run</guibutton>.
fr: Assurez-vous que <application>Thunar</application> est en cours d'exécution en mode démon. Le gestionnaire dépend de cela n'étant pas un démon lui-même. <application>Thunar</application> est automatiquement exécuté en mode démon au démarrage Xfce. Si pour une raison ou une autre le démon venait à être stoppé, ouvrez

source: Try running <application>thunar-volman</application> from a <application>Terminal</application> window after hot-plugging the drive or inserting the media. First, you need to figure out the HAL UDI of the new device using <application>lshal</application> or <application>hal-device</application>. Once you know the UDI, run <literal>thunar-volman --device-added &lt;udi-of-your-device&gt;</literal> in a <application>Terminal</application> window and watch the output for errors or warnings.
fr: Essayez d'exécuter <application>thunar-volman</application> à partir d'une fenêtre <application>Terminal</application> après la connexion du lecteur ou l'insertion du média. Tout d'abord vous devez connaître l'UDI HAL du nouveau périphérique en utilisant les commandes <application>lshal</application> ou <application>hal-device</application>. Une fois que vous connaissez son UDI, exécutez <literal>thunar-volman --device-added &lt;udi-de-votre-périphérique&gt;</literal> dans une fenêtre <application>Terminal</application> et vérifiez les messages d'erreurs ou d'avertissements.

source: If it still refuses to work, ask on the <ulink type="http" url="http://forum.xfce.org/">Xfce Forum</ulink> or the <ulink type="http" url="http://foo-projects.org/mailman/listinfo/thunar-dev">thunar-dev mailing list</ulink> for help.
fr: Au cas où cela ne fonctionnerait toujours pas, demandez de l'aide sur le <ulink type="http" url="http://forum.xfce.org/">forum Xfce</ulink> ou sur la <ulink type="http" url="http://foo-projects.org/mailman/listinfo/thunar-dev">liste de distribution thunar-dev</ulink>.

source: File Management Preferences
fr: Préférences du gestionnaire de fichiers

source: Use the <guilabel>File Manager Preferences</guilabel> dialog to set your <application>Thunar</application> file manager preferences. To open the preferences dialog, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences...</guimenuitem></menuchoice> from the menu bar, or click on the <guibutton>File Manager</guibutton> button in the Xfce Settings Manager.
fr: Pour ajuster les préférences de <application>Thunar</application>, utilisez le menu <menuchoice><guimenu>Éditer</guimenu><guimenuitem>Préférences...</guimenuitem></menuchoice> de la barre de menu ou cliquez sur le bouton <guibutton>Gestionnaire de fichiers</guibutton> du Gestionnaire de préférences Xfce.

source: The <guilabel>File Manager Preferences</guilabel> dialog is divided into four pages with different options, each described in a separate section below. Basically you can set preferences in the following categories:
fr: La fenêtre des <guilabel>Préférences du gestionnaire de fichiers</guilabel> est divisée en quatres sections contenant différentes options décrites plus bas. Elles se résument ainsi :

source: The default settings for the views.
fr: Préférences par défaut pour les vues.

source: The default settings for the side pane.
fr: Préférences par défaut pour le panneau latéral.

source: The behavior of the file manager windows.
fr: Le comportement de la partie principale du gestionnaire de fichiers.

source: Advanced features of the file manager.
fr: Les fonctions avancées du gestionnaire de fichiers.

source: Thunar also supports a bunch of so-called <emphasis>Hidden Options</emphasis>, which control several advanced features of the file manager, but are not included in the preferences in order to keep the preferences dialog simple. The <ulink type="http" url="http://svn.xfce.org/svn/xfce/thunar/trunk/docs/README.thunarrc"><filename>README.thunarrc</filename></ulink> file that is included with the Thunar distribution describes all available options in detail.
fr: Thunar supporte aussi une poignée d'<emphasis>Options cachées</emphasis> qui contrôlent plusieurs fonctionnalités avancées de thunar mais qui n'ont pas trouvé leur place dans le menu des préférences pour garder ce dernier simple et efficace. Le fichier <ulink type="http" url="http://svn.xfce.org/svn/xfce/thunar/trunk/docs/README.thunarrc"><filename>README.thunarrc</filename></ulink> distribué avec Thunar décrit ces options plus en détail.

source: Views Preferences
fr: Préférences des vues

source: You can specify a default view, select sort options and display options. You can also specify whether thumbnails should be displayed for file types that support this.
fr: Vous pouvez spécifier une vue par défaut, sélectionner le mode de tri des fichiers et définir des options d'affichage. Vous pouvez aussi définir si des miniatures de certains fichiers qui le supportent doivent être affichés.

source: View new folder using
fr: Voir un nouveau dossier en utilisant

source: Select the default view for folders. When you open a new window, the is displayed in the view that you select. This can be either the icon view, the compact list view or the detailed list view. You can also select <guilabel>Last Active View</guilabel> here to use the view you used for the last active window.
fr: Sélectionnez la vue par défaut pour les dossiers. Lorsque vous ouvrez un nouveau dossier, il est affiché avec la vue que vous avez choisi. Cette vue peut être soit la vue d'icônes, liste détaillée ou liste compacte. Il est aussi possible d'utiliser la <guilabel>Dernière vue active</guilabel> pour utiliser la vue de la dernière fenêtre active de Thunar.

source: Sort folders before files
fr: Trier les dossiers avant les fichiers

source: Select this option to list folders before files when you sort a folder.
fr: Sélectionnez cette option pour faire apparaître les dossiers avant les fichiers dans la fenêtre principale.

source: Show thumbnails
fr: Afficher les miniatures

source: Select this option to show thumbnails of image files and other supported files. The file manager stores the thumbnail files for each folder in the hidden <filename role="directory">.thumbnails</filename> directory in the user's Home Folder.
fr: Sélectionnez cette option pour afficher les miniatures des fichiers qui supportent cette option. Le gestionnaire de fichiers stocke les miniatures dans le dossier caché <filename role="directory">.thumbnails</filename> à l'intérieur du dossier personnel de l'utilisateur.

source: See <xref linkend="thumbnailers"/> if you want to extend the basic thumbnail functionality provided by <application>Thunar</application> with support for additional file types.
fr: Suivez le lien <xref linkend="thumbnailers"/> si vous voulez étendre les fonctionnalités basiques de miniatures de <application>Thunar</application> avec d'autres types de fichiers.

source: Text beside icons
fr: Texte à côté des icônes

source: Select this options to place the icon captions for items in the icon view beside the icon rather than under the icon.
fr: Sélectionnez cette option pour placer le texte des icônes à côté de ces derniers plutôt que dessous.

source: Side Pane Preferences
fr: Préférences du panneau latéral

source: You can select display options for the shortcuts pane and the tree pane.
fr: Vous pouvez définir des vues différentes pour le panneau latéral et d'arborescence.

source: The side pane can either display a list of shortcuts for folders in your file system, which is the default, or a tree view of your file system. This page allows you to select the size of the icons for the shortcuts and the tree pane. You can also specify whether emblems should be displayed.
fr: Le panneau latéral peut soit afficher des raccourcis vers certains dossier de votre système de fichiers, ce qui est son comportement par défaut, ou afficher une vue en arborescence. Cette page permet de définir la taille des icônes pour le panneau latéral et principal. Vous pouvez aussi choisir d'afficher ou non les emblèmes de dossier.

source: Icon Size
fr: Taille d'icône

source: The size of the icons displayed in the side, ranging from <guilabel>Very Small</guilabel> (around 16x16 pixels) to <guilabel>Very Large</guilabel> (around 128x128 pixels).
fr: La taille d'icône affichée dans le panneau latéral ou principal allant de <guilabel>Très petit</guilabel> (autour des 16x16 pixels) à <guilabel>Très grand</guilabel> (autour des 128x128 pixels).

source: Show Icon Emblems
fr: Afficher les emblèmes
