Repository: BelkaDev/thunar
Catalog: po-doc/*.po
Languages: fr

source: The <filename>eps-thumbnailer.desktop</filename> file uses the special key <literal>TryExec</literal>, which, if specified, names a command that must be present on the system for the thumbnailer to be useful. In this case, our script is useless if the <command>convert</command> utility is not present.
fr: Le fichier du créateur de miniatures <filename>eps-thumbnailer.desktop</filename> utilise la commande spéciale <literal>TryExec</literal>, qui, si elle est spécifiée, nomme une commande qui doit être présente dans le système pour que le créateur de miniatures soit utile. Le script serait inutile si la commande <command>convert</command> n'était pas disponible.

source: The last step is to regenerate the thumbnailer cache, so Thunar will pick up our thumbnailer. The thumbnailer cache is located at <filename>$XDG_CACHE_HOME/Thunar/thumbnailers.cache</filename> (unless overridden by your or your system administrator, the <varname>$XDG_CACHE_HOME</varname> points to the folder <filename role="directory">~/.cache/</filename>). The thumbnailers cache is regenerated periodically by Thunar, but you can force to regenerate it by invoking the <filename>thunar-vfs-update-thumbnailers-cache-1</filename> utility, that ships as part of Thunar. This utility is usually installed in the <filename role="directory">libexec</filename> subfolder of your installation prefix (<filename role="directory">sbin</filename> on Debian/Ubuntu). So for example, if Thunar is installed in <filename role="directory">/usr</filename>, invoke the utility as follows:
fr: La dernière étape est celle de régénérer le cache de créateurs de miniatures pour que Thunar soit au courant que nous lui en avons ajouté un. Le cache se situe dans <filename>$XDG_CACHE_HOME/Thunar/thumbnailers.cache</filename> (à moins que vous ou votre administrateur système n'ayez changé l'emplacement, <varname>$XDG_CACHE_HOME</varname> devrait se trouver dans <filename role="directory">~/.cache/</filename>). Le cache des créateurs de miniatures est automatiquement régénéré périodiquement par Thunar mais vous pouvez forcer ce rafraîchissement en invoquant la commande <filename>thunar-vfs-update-thumbnailers-cache-1</filename>. Cet utilitaire est installé, la plupart du temps, dans le sous-dossier <filename role="directory">libexec</filename> de votre préfixe d'installation (<filename role="directory">sbin</filename> dans Debian/Ubuntu). Donc, par exemple, si Thunar est installé dans <filename role="directory">/usr</filename>, la commande serait la suivante :

source: But make sure you run the program from your user account, not the superuser account, since the thumbnailers cache is stored in your home folder, rather than a system wide location.
fr: Mais soyez certain de bien exécuter la commande depuis votre compte d'utilisateur et non celui du super-utilisateur (root), car votre cache de miniatures se trouve dans votre dossier personnel et non dans un emplacement pour tout le système.

source: Now, if Thunar is compiled with support for file alteration monitoring (using the FAM or Gamin services), it will automatically pick up the new thumbnailers cache within a few seconds and afterwards be able to generate thumbnails using your custom thumbnailers. Otherwise you might need to completely restart Thunar to apply the changes, using
fr: Maintenant, si Thunar a été compilé avec le support un moniteur de modifications tel que FAM ou GAMIN, il va automatiquement prendre en compte le nouveau créateur de miniatures dans les secondes qui suivent et sera capable de créer des miniatures grâce à lui. Sinon il faudra redémarrer Thunar pour appliquer les changements en utilisant la commande :

source: to terminate any running instance, and afterwards restart it from your launcher.
fr: pour arrêter toute instance de Thunar et le relancer par la suite depuis son lanceur.

source: Cleaning up Thumbnails
fr: Purger les miniatures

source: The generated thumbnails are stored in the folder <filename role="directory">~/.thumbnails/</filename> complying with the <ulink type="http" url="http://jens.triq.net/thumbnail-spec/index.html">Thumbnail Management Standard</ulink>. While testing a new thumbnailer, it might help to clean up the thumbnail cache using
fr: Les miniatures créés sont stockés dans le dossier <filename role="directory">~/.thumbnails/</filename> en concordance avec la norme <ulink type="http" url="http://jens.triq.net/thumbnail-spec/index.html">Thumbnail Management Standard</ulink>. Lorsque vous testez un nouveau créateur de miniatures, il peut être préférable de d'abord purger les miniatures avec la commande suivante :

source: which will also give you some free space in your home folder. Since all the information stored within this folder was automatically generated from files in your file system, you will not loose any sensitive data.
fr: ce qui vous libérera aussi un peu d'espace dans votre dossier personnel. Les miniatures étant créées à partir de fichiers de votre système, vous ne perdrez pas de données en le vidant.

source: Advanced Topics
fr: Sujets avancés

source: To Bulk Rename Files
fr: Pour renommer plusieurs fichiers à la fois

source: To <emphasis>bulk rename</emphasis> files means to rename multiple files at once using some criterion, that applies to atleast one of the files. <application>Thunar</application> includes a bulk renamer, which can be run separately using the command <command>Thunar -B</command> or from within <application>Thunar</application> by selecting two or more files in the main area and pressing <keycombo><keycap>F2</keycap></keycombo> or choosing <menuchoice><guimenu>Edit</guimenu><guimenuitem>Rename...</guimenuitem></menuchoice> from the main menu.
fr: L'action de <emphasis>renommer en masse</emphasis> des fichiers utilise certains critères qui s'appliquent au moins à un des fichiers. <application>Thunar</application> inclut la fonctionnalité de renommer en masse en sélectionnant deux ou plusieurs fichiers et en choisissant <menuchoice><guimenu>Édition</guimenu><guimenuitem>Renommer...</guimenuitem></menuchoice> ou en appuyant sur la touche <keycombo><keycap>F2</keycap></keycombo>. Cette action peut aussi être exécutée séparément avec la commande <command>Thunar -B</command>.

source: Bulk Rename Files
fr: Renommer plusieurs fichiers

source: The <emphasis>Bulk Renamers</emphasis> can be applied to the name of the files, the suffix of the files or both to the name and the suffix of the files. <application>Thunar</application> currently supports the following <emphasis>Bulk Renamers</emphasis>:
fr: <emphasis>Renommer plusieurs fichiers</emphasis> change le nom du fichier mais peut aussi changer son extension. ou tous les deux. <application>Thunar</application> supporte les possibilités suivantes pour renommer les fichiers :

source: Remove characters.
fr: Supprimer des caractères.

source: Numbering files.
fr: Numéroter les fichiers.

source: Insert or overwrite characters.
fr: Insérer ou écraser des caractères.

source: Search and replace characters.
fr: Chercher et remplacer des caractères.

source: Convert to uppercase, lowercase or camlcase.
fr: Convertir en majuscule, minuscule ou 1ère LettreEnMajuscule (CamelCase)

source: Additional <emphasis>Bulk Renamers</emphasis> may be installed as plugins for <application>Thunar</application>. Check the <ulink type="http" url="http://thunar.xfce.org/plugins.html">Thunar Plugins</ulink> website for currently available extensions. The <ulink type="http" url="http://thunar.xfce.org/pwiki/documentation/bulk_renamer">Thunar Project Wiki</ulink> contains further details about this feature. Feel free to add more information to the Wiki.
fr: D'autres options pour <emphasis>renommer plusieurs fichiers</emphasis> peuvent être installés comme greffons pour <application>Thunar</application>. Visitez le site Web <ulink type="http" url="http://thunar.xfce.org/plugins.html">Thunar Plugins</ulink> pour prendre connaissance des extensions disponibles. Le <ulink type="http" url="http://thunar.xfce.org/pwiki/documentation/bulk_renamer">Thunar Project Wiki</ulink> contient de plus amples renseignements à ce sujet. Vous pouvez aussi ajouter des informations à ce site.

source: The UNIX File System
fr: Le système de fichiers UNIX

source: While the Thunar file manager does a good job at abstracting the details of the underlying file system, so the user does not need to care about them, it is sometimes useful to understand the basic concepts to get the whole picture. This section tries to give a brief introduction to the concepts of the UNIX file system, which is used today by all incarnations of UNIX, including Linux.
fr: Bien que le gestionnaire de fichiers <application>Thunar</application> s'occupe de faire abstraction, pour l'utilisateur, du système de fichiers sous-jacent, il est préférable, dans bien des cas, d'en connaître les bases. Cette section du manuel est une brève introduction au système de fichiers UNIX utilisé de nos jours par toutes ses versions dérivées, dont Linux fait partie.

source: Folders and Paths
fr: Dossiers et chemins d'accès

source: In a UNIX file system all folders are arranged in a simple inverted tree structure descending and branching down from a single top level folder, which is called the <emphasis>root directory</emphasis> (the term <emphasis>directory</emphasis> is often used instead of <emphasis>folder</emphasis>) and displayed as <guilabel>File System</guilabel> in Thunar. This means that you can get from any folder to any other by going up the tree until you reach a common point, then down the tree through the appropriate subfolders until you reach your target.
fr: Dans le système de fichiers UNIX, tous les dossiers sont arrangés dans une simple structure d'arborescence inversée où l'on nomme la base le <emphasis>répertoire racine</emphasis> (le terme <emphasis>répertoire</emphasis> est souvent utilisé à la place de <emphasis>dossier</emphasis>) et <application>Thunar</application> s'occupe d'afficher cela comme <guilabel>Systéme de fichiers</guilabel>. Cette arborescence inversée signifie que l'on peut aller d'un dossier à un autre en remontant l'arbre jusqu'à un point commun reliant les deux dossiers, pour redescendre l'arbre à travers les sous-dossiers jusqu'à la destination voulue.

source: The position of any file or folder in the tree can be described by its <emphasis>path</emphasis>. The path is the list of folders you would have to descend through to get to the target folder or file, starting from the top level folder. For example <filename role="directory">/home/luke</filename> is the subfolder <filename role="directory">luke</filename> of the subfolder <filename role="directory">home</filename> of the top level folder, and <filename>/home/luke/myfile.txt</filename> is the file <filename>myfile.txt</filename> in that subfolder. The leading <filename role="directory">/</filename> in these paths represents the top level folder.
fr: La position de chaque dossier ou fichier peut être définie par son <emphasis>chemin d'accès</emphasis>. Le chemin d'accès est la liste des dossiers à traverser pour accéder au dossier de destination, en partant depuis la racine. Par exemple, <filename role="directory">/home/martin</filename> est le sous-dossier <filename role="directory">martin</filename> du sous-dossier <filename role="directory">home</filename> du dossier racine et <filename>/home/martin/monfichier.txt</filename> est le fichier <filename>monfichier.txt</filename> dans ce sous-dossier. La barre oblique <filename role="directory">/</filename> dans ces chemins d'accès, représente le dossier racine.

source: Every user has their own folder to hold their personal files and settings. This folder is called the <emphasis>home directory</emphasis> and is displayed in Thunar as special icon with the users login name. The folder is similar to the <guilabel>My Files</guilabel> folder known from Windows. The <emphasis>home directories</emphasis> of the various users in a system are usually located below the <filename role="directory">/home</filename> folder. For example <filename role="directory">/home/luke</filename> would be the home directory of the user with the login name <filename role="directory">luke</filename>, while <filename role="directory">/home/jane</filename> would be the home directory for the user with the login name <filename role="directory">jane</filename>.
fr: Chaque utilisateur a son propre dossier contenant ses fichiers personnels et ses configurations. Ce dossier est appelé <emphasis>répertoire personnel</emphasis> et s'affiche dans <application>Thunar</application> avec une icône spéciale et le nom de l'utilisateur. Ce dossier pourrait être assimilé au dossier <guilabel>Mes Fichiers</guilabel> de Windows. Les <emphasis>répertoires personnels</emphasis> des différents utilisateurs du système sont, la plupart du temps, situés dans le dossier <filename role="directory">/home</filename>. Par exemple, le dossier personnel <filename role="directory">/home/martin</filename> serait le dossier personnel de l'utilisateur <filename role="directory">martin</filename>, alors que le dossier personnel pour l'utilisatrice <filename role="directory">marie</filename> serait <filename role="directory">/home/marie</filename>.

source: File Types
fr: Types de fichiers

source: You may have already heard that everything is a file in UNIX. This is true for most objects present in UNIX systems today. In fact even devices are represented as a special files. While this may not make sense at first sight, it is one of the strengths of UNIX and its derivates, and has helped it to maintain a simple core over the years where other operating systems had to introduce new concepts for every new technology.
fr: Vous avez probablement déjà entendu que tout est un fichier sous UNIX. Ceci est vrai pour la plupart des objets présents dans les systèmes UNIX de nos jours. Même les périphériques sont représentés comme des fichiers spéciaux. Cela peut paraître bizarre mais c'est cette particularité qui a permis à UNIX et ses dérivés de garder un noyau simple à travers les années, là où d'autres systèmes d'opérations ont dû introduire de nouveaux concepts pour chaque nouvelle technologie.

source: These are the four most important types of files in the UNIX file system.
fr: Il existe quatre types de fichiers importants dans le système de fichier UNIX.

source: Ordinary Files
fr: Les fichiers ordinaires

source: An ordinary file may contain text, a program or other data. This includes image files, audio files, office documents and video files. The term <emphasis>file</emphasis> is often used to refer to an ordinary file.
fr: Un fichier ordinaire peut contenir du texte, un programme ou d'autres données. Ceci inclut les fichiers image, fichiers son, documents ou fichiers vidéo. Le terme <emphasis>fichier</emphasis> est souvent utilisé pour faire référence à un fichier ordinaire.

source: Folder Files
fr: Fichiers de dossier

source: Folders are also files in the UNIX file system. To be exact a folder is a special file, which contains a mapping of file names to file references for every file contained within this folder.
fr: Les dossiers sont aussi des fichiers dans le système de fichiers UNIX. Pour être exact, un dossier est un fichier spécial, contenant une liste de noms de fichiers faisant référence aux fichiers contenu dans le dossier.

source: Symbolic Link Files
fr: Fichiers de lien symbolique

source: A Symbolic link (often called a <emphasis>symlink</emphasis>) is a special file that contains a path to another file in the file system. Symbolic link files therefore do not contain any useful information themselves, but just refer to other files.
fr: Un lien symbolique (fréquemment appelé <emphasis>symlink</emphasis>) est aussi un fichier spécial contenant un chemin d'accès vers un autre fichier dans le système de fichiers. De ce fait, les liens symboliques ne contiennent pas d'informations outre celle de la référence à d'autres fichiers.

source: Device Files
fr: Fichiers de périphérique

source: As mentioned earlier (most) devices are also accessed through the file system. These special device files are usually located in the <filename role="directory">/dev</filename> folder. For example the special file <filename>/dev/hda</filename> represents the first IDE disk on Linux.
fr: Comme nous l'avons vu auparavant, la plupart des périphériques sont aussi accédés à travers du système de fichiers. Ces fichiers spéciaux de périphériques se trouvent la plupart du temps dans le dossier <filename role="directory">/dev</filename>. Par exemple, le fichier spécial <filename>/dev/hda</filename> représente le premier disque dur IDE dans les systèmes Linux.

source: Frequently Asked Questions
fr: Questions Fréquemment posées

source: The intent of this section is to collect the quite numerous frequently asked questions that relate to working with Thunar. If you know of a question that is missing from this page, please <ulink type="http" url="http://bugzilla.xfce.org/enter_bug.cgi?product=Thunar&amp;format=guided">file a request</ulink>.
fr: Le but de cette section du manuel est de rassembler les questions en rapport avec Thunar les plus fréquemment posées. Si vous trouvez qu'une question manque à l'appel, n'hésitez pas à nous le faire savoir en remplissant une requête de <ulink type="http" url="http://bugzilla.xfce.org/enter_bug.cgi?product=Thunar&amp;format=guided">bogue</ulink>.

source: Why doesn't Thunar execute files marked as executable?
fr: Pourquoi est-ce-que Thunar n'exécute pas les fichiers marqués comme exécutables ?

source: For security reasons Thunar only executes files of type <literal>application/x-desktop</literal>, <literal>application/x-executable</literal> and <literal>application/x-shellscript</literal>. For desktop files the execution feature will only be enabled if the desktop file is of type <literal>Application</literal> and a valid <literal>Exec</literal> line is given or of type <literal>Link</literal> and a valid <literal>URL</literal> is given. For the other types the feature is available if the file is marked executable for the current user.
fr: Pour des raisons de sécurité, Thunar n'exécute que les fichiers de type <literal>application/x-desktop</literal>, <literal>application/x-executable</literal> et <literal>application/x-shellscript</literal>. L'exécution de fichiers du bureau n'est possible que si le fichier en question est de type <literal>Application</literal> et possède un champ <literal>Exec</literal> valide ou alors de type <literal>Link</literal> avec un champ <literal>URL</literal> valide. Pour les autres types de fichiers, seuls fonctionnent ceux marqués exécutables par l'utilisateur.

source: Also note that for <literal>application/x-executable</literal> and <literal>application/x-shellscript</literal>, the types of the file don't really need to match these types exactly, but it is suffice if the detected type has a parent that matches one of the two types listed above, or if the MIME-type is an alias for one of the above.
fr: Notez bien que pour <literal>application/x-executable</literal> et <literal>application/x-shellscript</literal>, il n'est pas nécessaire que le type de fichier corresponde exactement à ces types. Il suffit que le type détecté ait un type parent qui correspond à un des deux types mentionnés plus-haut ou que le type MIME ait un alias vers l'un d'eux.

source: Where does Thunar store the metadata associated with files?
fr: Où Thunar stocke-t'il les metadatas associés aux fichiers ?

source: Thunar associates various settings with files/folders, which we call metadata. This metadata for all files is stored in tdb database file, which is called the metafile. The database file is stored in <filename>$XDG_CACHE_HOME/Thunar/metafile.tdb</filename> and can be examined using the <command>tdbtool</command>, which is part of the Thunar distribution (located in the <filename role="directory">tdb/</filename> subdirectory).
fr: Thunar associe divers paramètres avec des fichiers/dossiers, nous les appelons les metadatas. Ces metadatas pour les fichiers sont stockés dans une base de données tdb que l'on nomme metafile. La base de donnée est stockée dans <filename>$XDG_CACHE_HOME/Thunar/metafile.tdb</filename> et peut être examinée en utilisant la commande <command>tdbtool</command>. Ce dernier fait partie de la distribution Thunar et se trouve dans le dossier <filename role="directory">tdb/</filename>.

source: Where does Thunar store its preferences?
fr: Où Thunar stocke-t'il ses paramètres ?

source: Thunar stores the user configurable preferences (and hidden settings) in an <filename>.ini</filename> file, which is located at <filename>$XDG_CONFIG_HOME/Thunar/thunarrc</filename> and can be examined using a text editor. See <filename>docs/README.thunarrc</filename> for an overview of the various preferences.
fr: Thunar stocke ses paramètres, ainsi que les paramètres cachés, dans un fichier <filename>.ini</filename> situé dans le dossier <filename>$XDG_CONFIG_HOME/Thunar/thunarrc</filename> et peut être lu par tout éditeur de texte. Lisez la section <filename>docs/README.thunarrc</filename> pour une vue d'ensemble des différents paramètres.

source: How to use mouse gestures in Thunar?
fr: Comment utiliser les "mouse gestures" dans Thunar ?

source: Thunar currently features basic support for so called <emphasis>mouse gestures</emphasis> in its icon view. You can use these <emphasis>mouse gestures</emphasis> by holding down the middle mouse button (usually the mouse wheel) while the mouse pointer is on the background area of the icon view component (any area that is not covered by an icon or a text). Now you can move the cursor into four directions to perform certain actions, which are described below.
fr: Thunar a un support de base pour les "<emphasis>mouse gestures</emphasis>" (gestes de la souris) dans la vue d'icône. Pour utiliser les <emphasis>mouse gestures</emphasis>, il suffit de se placer sur une partie sans icône de la fenêtre principale de Thunar et maintenir le bouton du milieu de la souris (souvent la molette de la souris) enfoncé en faisant un mouvement dans la direction voulue. Les directions ont les fonctions suivantes :

source: Left
fr: Gauche

source: <placeholder-1/> - opens the previous visited folder
fr: <placeholder-1/> - ouvre le dossier précédemment ouvert

source: Up
fr: Haut

source: <placeholder-1/> - opens the parent folder
fr: <placeholder-1/> - Ouvre le dossier parent

source: Right
fr: Droite

source: <placeholder-1/> - opens the next visited folder
fr: <placeholder-1/> - ouvre le dossier visité suivant

source: Down
fr: Bas

source: <placeholder-1/> - reloads the current folder
fr: <placeholder-1/> - Rafraîchit le dossier actuel

source: How do I assign different keyboard shortcuts?
fr: Comment assigner différents raccourcis clavier ?

source: If you want to rebind a shortcut, Thunar supports the standard GTK+ way of changing shortcuts: simply hover over the menu option with the mouse pointer and press the keyboard shortcut you want to rebind it to.
fr: Si vous voulez assigner un nouveau raccourci ou changer un existant dans Thunar, le mode GTK+ de changement de raccourcis est supporté : simplement placer le pointeur de la souris sur l'option du menu que vous voulez changer et appuyer le raccourci clavier désiré pour l'assigner.

source: To delete a keyboard assignment, press the <keycap>Backspace</keycap> key while you are on the menu entry.
fr: Pour effacer un raccourci, placez le pointeur de la souris sur l'option du menu et pressez la touche <keycap>Effacer</keycap>.
