Repository: BelkaDev/thunar
Catalog: po-doc/*.po
Languages: fr

source: Select this option to display emblems for folders in the side pane. You can assign emblems to folders in the <guilabel>Properties</guilabel> dialog. Select a folder in the main area and choose <menuchoice><guimenu>File</guimenu><guimenuitem>Properties...</guimenuitem></menuchoice> from the main menu, or right-click the folder and select <menuchoice><guimenuitem>Properties...</guimenuitem></menuchoice> from the context menu.
fr: Sélectionnez cette option pour afficher des emblèmes pour les dossiers. Pour assigner un emblème à un dossier il faut le sélectionner et choisir <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Propriétés...</guimenuitem></menuchoice> dans le menu principal ou cliquer dessus à l'aide du bouton droit de la souris et choisir <menuchoice><guimenuitem>Propriétés...</menuchoice></guimenuitem> dans le menu contextuel.

source: Behavior Preferences
fr: Préférences de comportement

source: You can select the preferred behavior to interact with the file manager.
fr: Vous pouvez choisir le comportement préféré lors de l'interaction avec le gestionnaire de fichiers.

source: Single click to active items
fr: Simple clic pour activer les éléments

source: Select this option to perform the default action for an item when you click on the item. When this option is selected, and you point to an item, the title of the item is underlined and the item will be selected automatically after a short delay.
fr: Sélectionnez cette option pour accomplir l'action par défaut sur cet élément lors d'un simple clic. Lorsque cette option est sélectionnée et vous pointez la souris sur un élément, le titre de ce dernier se verra souligné et il sera sélectionné automatiquement après un court délai.

source: This delay can be configured below the option. You can also disable the automatic selection of items by moving the selector to the left-most position.
fr: Ce délai peut être défini sous l'option en question. Vous pouvez aussi désactiver la sélection automatique en glissant le curseur vers la position gauche absolue.

source: Double click to activate items
fr: Double clic pour activer les éléments

source: Select this option to perform the default action for an item when you double click on the item, and select the item with a single click.
fr: Sélectionnez cette option pour accomplir l'action par défaut sur cet élément lors d'un double clic et l'activer lors d'un simple clic.

source: Advanced Preferences
fr: Préférences avancées

source: You can control advanced features of the file manager.
fr: Vous pouvez contrôler les préférences avancées du gestionnaire de fichiers.

source: Folder Permissions
fr: Permissions de dossiers

source: Choose the action that should be performed when you change the permissions of a folder in the <guilabel>Properties</guilabel> dialog. You can choose to let <application>Thunar</application> ask everytime when you change folder permissions, tell it to default to applying the new permissions to the folder only or to apply them recursively to the folder contents as well.
fr: Choisissez l'action à accomplir lorsque vous changez les permissions d'un dossier dans ses <guilabel>Propriétés</guilabel>. Vous avez le choix entre laisser <application>Thunar</application> vous poser la question à chaque fois que vous changerez les permissions d'un dossier, le laisser appliquer les changements au dossier ou au dossier et son contenu.

source: Volume Management
fr: Gestionnaire de volume

source: If <application>Thunar</application> was installed with support for HAL and the <application>thunar-volman</application> package is also installed, you can enable the integrated volume manager. See <xref linkend="management-of-removable-drives-and-media"/> for details about this feature.
fr: Si <application>Thunar</application> a été installé avec le support HAL et le paquet <application>thunar-volman</application> est aussi installé, vous pouvez activer le gestionnaire de volume intégré. Voir <xref linkend="management-of-removable-drives-and-media"/> pour plus de détails à propos de cette particularité.

source: Customizing Thunar
fr: Personnaliser Thunar

source: This chapter describes how to customize certain parts of the file manager to your own needs.
fr: Cette section décrit comment vous pouvez personnaliser certaines parties du gestionnaire de fichiers.

source: The "Send To" Menu
fr: Le menu "Envoyer vers"

source: Thunar includes a <guilabel>Send To</guilabel> menu, which provides possible targets where files and folders can be sent to. To access the <guilabel>Send To</guilabel> menu, choose <menuchoice><guimenu>File</guimenu><guimenuitem>Send To</guimenuitem></menuchoice> from the main menu, or right-click on a file or folder and choose <menuchoice><guimenuitem>Send To</guimenuitem></menuchoice>.
fr: Thunar inclut un menu <guilabel>Envoyer vers</guilabel> qui permet d'envoyer certains fichiers ou dossiers vers une destination prédéfinie. Pour accéder au menu <guilabel>Envoyer vers</guilabel>, choisissez <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Envoyer vers</guimenuitem></menuchoice> dans le menu principal ou cliquez-droit sur un fichier ou dossier et choisissez <menuchoice><guimenuitem>Envoyer vers</guimenuitem></menuchoice>.

source: "Send To" Menu
fr: Menu "Envoyer vers"

source: By default, the <guilabel>Send To</guilabel> menu includes an entry named <guilabel>Desktop (Create Link)</guilabel> for all files and folders, which simply creates a link on the desktop for each selected file. In addition, if the <guilabel>Shortcuts Pane</guilabel> is active, the menu also includes an entry called <guilabel>Side Pane (Create Shortcut)</guilabel> for folders, which allows users to add new shortcuts to the side pane. Following these entries, <application>Thunar</application> lists the removable drives currently plugged into the computer. In the screenshot above, the <guilabel>Floppy Drive</guilabel> represents a possible target where files can be sent to. Note that the device is mounted automatically once selected from the <guilabel>Send To</guilabel> menu, so you do not need to manually mount it.
fr: Par défaut le menu <guilabel>Envoyer vers</guilabel> contient un élément <guilabel>Bureau (Créer lien)</guilabel> pour tous les fichiers et dossiers. Cet élément crée un lien sur le bureau vers le fichier ou dossier sélectionné. Si le <guilabel>Panneau des raccourcis</guilabel> est actif, vous trouverez aussi dans le menu un élément <guilabel>Panneau latéral (Créer raccourci)</guilabel> pour les dossiers, ce qui vous permets de créer de nouveaux raccourcis dans le panneau latéral. À la suite de ces éléments du menu <guilabel>Envoyer vers</guilabel>, Thunar vient ajouter à la liste les disques amovibles actuellement branchés à l'ordinateur. Dans la capture d'écran ci-dessus, le <guilabel>Lecteur de disquettes</guilabel> représente une destination possible pour l'envoi de fichiers. Le disque est "monté" (mount) automatiquement à la sélection dans le menu <guilabel>Envoyer vers</guilabel> pour que vous n'ayez pas besoin de le faire vous-même.

source: In addition <application>Thunar</application> also ships the <application>thunar-sendto-email</application> plugin, which adds the entry <guilabel>Mail Recipient</guilabel> to the menu, that opens the mail composer with the selected files attach to the new email. If the selection contains atleast one folder, the selected items are added to a ZIP archive before attaching them to the email. Otherwise, if the selection contains multiple files, or a single file, which is larger than 200Kib, the user will be prompted whether to pack the files into a ZIP archive, and send the ZIP archive.
fr: <application>Thunar</application> contient d'office un greffon <application>thunar-sendto-email</application> qui ajoute l'élément <guilabel>Destinataire courriel</guilabel> au menu. Ce dernier permet d'envoyer les fichiers ou dossiers sélectionnés, avec le programme de messagerie par défaut. Si la sélection contient au moins un dossier, le tout est ajouté dans une archive ZIP avant d'être attaché au courriel. Le gestionnaire de fichiers demandera à l'utilisateur s'il faut compresser les fichiers avant de les envoyer, dans le cas de fichiers multiples ou dépassant 200Ko.

source: Like most other features of <application>Thunar</application>, the <guilabel>Send to</guilabel> menu can be easily extended by users and application developers with new targets, using standard <ulink type="http" url="http://freedesktop.org/wiki/Standards_2fdesktop_2dentry_2dspec">desktop entry files</ulink>. These files must be installed into one of the <filename role="directory">$XDG_DATA_DIRS/Thunar/sendto/</filename> folders (see the <ulink type="http" url="http://freedesktop.org/wiki/Standards_2fbasedir_2dspec">XDG Base Directory Specification</ulink> for details about the <literal>$XDG_DATA_DIRS</literal> variable).
fr: Comme la plupart des particularités de <application>Thunar</application>, le menu <guilabel>Envoyer vers</guilabel> peut aisément être personnalisé avec de nouveaux éléments par l'utilisateur ou les développeurs d'applications en utilisant des fichiers standards <ulink type="http" url="http://freedesktop.org/wiki/Standards_2fdesktop_2dentry_2dspec">desktop entry files</ulink>. Ces fichiers doivent êtres installés dans un des dossiers <filename role="directory">$XDG_DATA_DIRS/Thunar/sendto/</filename> (suivez le lien <ulink type="http" url="http://freedesktop.org/wiki/Standards_2fbasedir_2dspec">XDG Base Directory Specification</ulink> pour plus de détails à propos de la variable <literal>$XDG_DATA_DIRS</literal>).

source: The <literal>MimeType</literal> of the target <filename>.desktop</filename> specifies the types of files for which this action should be available in the <guilabel>Send To</guilabel> menu. For example, say you want to add entry for a <ulink type="http" url="http://flickr.com/">Flickr</ulink> uploader tool, then this entry should only show up if the selection contains JPEG files (other file formats are not supported by Flickr) and so you should add a line <literal>MimeType=image/jpeg;</literal>. If you do not specify any <literal>MimeType</literal> your entry will show up for all file types.
fr: Le <literal>MimeType</literal> de la destination <filename>.desktop</filename> spécifie le type de fichiers pour lesquels cette action doit apparaître dans le menu <guilabel>Envoyer vers</guilabel>. Par exemple, imaginons un instant que vous vouliez ajouter un élément permettant de télécharger (upload) vers le site <ulink type="http" url="http://flickr.com/">Flickr</ulink>, cet élément ne devrait s'afficher que pour les images au format JPEG (d'autres formats ne sont pas supportés par flickr). Vous devriez donc ajouter la ligne <literal>MimeType=image/jpeg;</literal> dans les types de votre élément. Si vous ne spécifiez pas de <literal>MimeType</literal>, votre élément s'affichera pour tous les fichiers.

source: A complete example using the <application>postr</application> application is shown below:
fr: Ci-dessous se trouve un exemple complet utilisant l'application <application>postr</application> :

source: # postr.desktop - Integrate postr into # the "Send To" menu. [Desktop Entry] Type=Application Version=1.0 Encoding=UTF-8 TryExec=postr Exec=postr %F Icon=postr Name=Flickr MimeType=image/jpeg;
fr: # postr.desktop - Intégrer postr dans # le menu "Envoyer vers". [Desktop Entry] Type=Application Version=1.0 Encoding=UTF-8 TryExec=postr Exec=postr %F Icon=postr Name=Flickr MimeType=image/jpeg;

source: If you install this file to <filename role="directory">~/.local/share/Thunar/sendto/</filename> (create the folder if it does not exist yet), the <guilabel>Send To</guilabel> menu for JPEG files will show the new entry <guilabel>Flickr</guilabel>, which can be used to upload JPEG images to Flickr.
fr: Si vous installez ce fichier dans <filename role="directory">~/.local/share/Thunar/sendto/</filename> (créez le dossier s'il n'existe pas encore), le menu <guilabel>Envoyer vers</guilabel> comprendra le nouvel élément <guilabel>Flickr</guilabel> pour tous les fichiers JPEG et pourra être utilisé pour envoyer des images sur le site Flickr.

source: The <ulink type="http" url="http://thunar.xfce.org/pwiki/documentation/sendto_menu">Thunar Project Wiki</ulink> contains additional examples of useful targets for the <guilabel>Send To</guilabel> menu. Feel free to extend the Wiki page with new examples.
fr: Le site <ulink type="http" url="http://thunar.xfce.org/pwiki/documentation/sendto_menu">Thunar Project Wiki</ulink> contient d'autres exemples d'éléments utiles pour le menu <guilabel>Envoyer vers</guilabel>. N'hésitez pas à compléter le wiki avec vos suggestions.

source: Thumbnailers
fr: Thumbnailers (Créateurs de miniatures)

source: Thunar uses small utilities to create thumbnails of certain file types and displays the thumbnails as preview of the file content. These small tools are called thumbnailers. Thunar ships with thumbnailers for image and font files, and makes use of the installed thumbnailers from GNOME automatically if it was installed with support for <literal>gconf</literal>. Users may however dynamically extend this basic functionality with thumbnailers for additional file types.
fr: Thunar utilise de petits utilitaires pour créer les miniatures de certains types de fichiers et affiche ces miniatures comme pré-visualisation du contenu dudit fichier. Ces petits utilitaires sont appelés des "thumbnailers". Thunar vient d'office avec plusieurs créateurs de miniatures installés et fait usage des facilités de créations de miniatures offertes par GNOME s'il a été installé avec le support <literal>gconf</literal>. L'utilisateur peut néanmoins ajouter à ces fonctions de base, tout créateur de miniatures additionnel pour différents types de fichiers.

source: If you plan to write a custom thumbnailers, you need to start with a program that accepts atleast two command line parameters, the input file, which is of the file type you plan to support and the output file, which is a PNG file that complies with the format specified by the <ulink type="http" url="http://jens.triq.net/thumbnail-spec/creation.html#AEN139">Thumbnail Management Standard</ulink>. Additionally your program may also accept the desired size of the thumbnail, which is optional but highly recommended. If you write the output file at an arbitrary image size, Thunar will afterwards scale it to the desired size, which might produce a less optimal result than generating the thumbnail with the requested dimensions.
fr: Si vous envisagez d'écrire un créateur de miniatures personnalisé, vous devez vous assurer que votre programme supporte au moins deux lignes de commande, le fichier d'entrée, qui serait votre type de fichier à ajouter et le fichier de sortie, qui doit être au format PNG et conforme aux spécifications du <ulink type="http" url="http://jens.triq.net/thumbnail-spec/creation.html#AEN139">Thumbnail Management Standard</ulink>. En plus, votre programme pourrait accepter les tailles définies de miniatures, ce qui est optionnel mais fortement recommandé. Si vous optez pour ne pas suivre la taille définie de miniature, Thunar viendrait à redimensionner l'image pour lui donner la taille standard et le résultat pourrait être inférieur en qualité qu'un dimensionnement juste dès le départ.

source: Once your utility to generate the thumbnails is done, you will need to register your thumbnailer, so Thunar is able to locate and use it. Therefore all you need to do is to install a description file for the thumbnailer (a <filename>.desktop</filename> file) in one of the <filename role="directory">$XDG_DATA_DIRS/thumbnailers/</filename> paths. For example, if you want to register the thumbnailer for your user account only, you can install the file into the folder <filename role="directory">~/.local/share/thumbnailers/</filename>. The <filename>.desktop</filename> for thumbnailers has the following format.
fr: Une fois votre utilitaire terminé, vous devrez l'enregistrer auprès de Thunar pour qu'il puisse en faire usage. Pour cela il vous suffit d'installer un fichier de description pour votre créateur de miniatures (un fichier <filename>.desktop</filename>) dans un des dossiers <filename role="directory">$XDG_DATA_DIRS/thumbnailers/</filename>. Par exemple, si vous voulez utiliser le créateur de miniatures uniquement pour votre utilisateur, vous installerez le fichier de description dans le dossier <filename role="directory">~/.local/share/thumbnailers/</filename>. Le fichier <filename>.desktop</filename> pour le créations de miniatures a le format suivant.

source: Thumbnailer Description File Format
fr: Fichier de description de création de miniatures

source: Thumbnailer description files utilize the <ulink type="http" url="http://standards.freedesktop.org/desktop-entry-spec/latest/">Desktop Entry Format</ulink> with a special <literal>Type</literal> of <literal>X-Thumbnailer</literal> and special field <literal>X-Thumbnailer-Exec</literal> with new field codes. Basically, a thumbnailer description file has the following format.
fr: Les fichiers de description de créateurs de miniatures utilisent le format <ulink type="http" url="http://standards.freedesktop.org/desktop-entry-spec/latest/">Desktop Entry Format</ulink> avec un <literal>Type</literal> spécial <literal>X-Thumbnailer</literal> et de nouveaux codes dans le champ <literal>X-Thumbnailer-Exec</literal>. D'une certaine manière, un fichier de description d'un créateur de miniatures a le format suivant :

source: [Desktop Entry] Version=1.0 Encoding=UTF-8 Type=X-Thumbnailer Name=Your Thumbnailer MimeType=your-supported/mime-type; X-Thumbnailer-Exec=your-thumbnailer %i %o %s
fr: [Desktop Entry] Version=1.0 Encoding=UTF-8 Type=X-Thumbnailer Name=Your Thumbnailer MimeType=your-supported/mime-type; X-Thumbnailer-Exec=votre-créateur-de-miniatures %i %o %s

source: The <literal>Version</literal> and <literal>Encoding</literal> are mandated by the Desktop Entry Specification, just use the values shown in the example above. The <literal>Type</literal> field must have the special value <literal>X-Thumbnailer</literal>, otherwise your thumbnailer will not be recognized. The <literal>Name</literal> value describes your thumbnailer.
fr: Les champs <literal>Version</literal> et <literal>Encoding</literal> sont ordonnés par le "Desktop Entry Specification", utilisez les valeurs utilisées dans l'exemple ci-dessus. Le champ <literal>Type</literal> doit impérativement contenir la valeur <literal>X-Thumbnailer</literal> faute de quoi le créateur de miniatures ne serait pas reconnu. Le champ <literal>Name</literal> décrit votre créateur de miniatures.

source: The <literal>X-Thumbnailer-Exec</literal> field contains the command to run your thumbnailer, and supports certain field codes that will be substituted when the thumbnailer is run. Recognized field codes are as follows:
fr: Le champ <literal>X-Thumbnailer-Exec</literal> contient la commande à exécuter pour le créateur de miniatures et supporte certains codes qui se substitueront à l'exécution. Les codes reconnus sont les suivants :

source: The local path to the input file for which to create a thumbnail. May be either a path relative to the directory from which the thumbnailer was invoked or an absolute path.
fr: Le chemin d'accès jusqu'au fichier pour lequel il faut créer une miniature. Peut être un chemin d'accès partant du dossier d'où est exécuté le créateur de miniatures ou un chemin d'accès complet.

source: The local path to the output file where to store the generated thumbnail. The output file must be written as valid PNG file according to the thumbnail standard (see above). Note that the path may not end with <placeholder-1/>, which matters if you invoke certain third party tools.
fr: Le chemin d'accès jusqu'au fichier de sortie contenant la miniature générée. Le fichier de sortie doit être au format PNG en concordance avec le standard de miniatures (voir plus haut). Le fichier ne doit pas obligatoirement se terminer par <placeholder-1/>, surtout si vous utilisez une tierce application.

source: The desired size of the generated thumbnail in pixels. This parameter is optional.
fr: La taille voulue de la miniature en pixels. Ce paramètre est optionnel.

source: Similar to <placeholder-1/>, but substituted with the URI of the file, rather than the path. This was added for compatibility with GNOME.
fr: Similaire à <placeholder-1/> mais substitué à l'URI du fichier plutôt qu'à son chemin d'accès. Ceci a été ajouté pour la compatibilité avec GNOME.

source: Will be substituted with a single <placeholder-1/>.
fr: Se substitue par un simple <placeholder-1/>.

source: You need to include atleast <literal>%o</literal> and <literal>%i</literal> or <literal>%u</literal>, otherwise your thumbnailer will be useless.
fr: Vous devez au moins inclure <literal>%o</literal> et <literal>%i</literal> ou <literal>%u</literal>, sinon votre créateur de miniatures sera inutile.

source: The <literal>MimeType</literal> lists the MIME types - separated by semicolon - for which your thumbnailer is able to create previews.
fr: Le champ <literal>MimeType</literal> liste les types MIME - séparés par un point-virgule - pour lesquels votre créateur de miniatures est capable de créer des miniatures.

source: Example EPS Thumbnailer
fr: Exemple d'un créateur de miniatures pour EPS

source: This example demonstrates how to write and install a new thumbnailer for <filename>.eps</filename> files, which uses the <command>convert</command> utility that ships as part of ImageMagick. First, we start with a simple script that invokes <command>convert</command> to generate a thumbnail at the requested size.
fr: Cet exemple démontre comment écrire et installer un nouveau créateur de miniatures pour les fichiers de type <filename>.eps</filename> qui utilise la commande <command>convert</command> de la suite ImageMagick. Nous commençons par invoquer la commande <command>convert</command> pour générer une miniature à la taille voulue.

source: #!/bin/sh # # eps-thumbnailer - Example thumbnailer script for EPS files. # # Usage: esp-thumbnailer eps-file png-file size # # command line parameters ifile=$1 ofile=$2 size=$3 # invoke convert (ImageMagick) exec convert "eps:$ifile" -scale "$sizex$size" "png:$ofile"
fr: #!/bin/sh # # eps-thumbnailer - Exemple de script pour la création de miniatures pour les fichiers EPS. # # Utilisation: esp-thumbnailer fichier-eps fichier-png taille # # paramètres de la ligne de commande ifile=$1 ofile=$2 size=$3 # invoke convert (ImageMagick) exec convert "eps:$ifile" -scale "$sizex$size" "png:$ofile"

source: Save this script above to a file <filename>eps-thumbnailer</filename>, make sure the file is executable and install it to <filename role="directory">/usr/local/bin</filename>.
fr: Enregistrez le script ci-dessus dans un fichier <filename>eps-thumbnailer</filename>, assurez-vous qu'il soit bien exécutable et installez le dans <filename role="directory">/usr/local/bin</filename>.

source: Next we need to create the thumbnail description file <filename>eps-thumbnailer.desktop</filename>, which looks like this:
fr: Ensuite nous allons créer le fichier de description <filename>eps-thumbnailer.desktop</filename> qui ressemble à cela :

source: This file must be installed to <filename role="directory">/usr/local/share/thumbnailers</filename> (create the folder if it does not exists).
fr: Ce fichier doit être installé dans le dossier <filename role="directory">/usr/local/share/thumbnailers</filename> (créez le s'il n'existe pas).
